InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<Comment>Контактная информация контрагентов, контактных лиц, организаций и сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Comment>Признак значения по умолчанию</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Comment>Вспомогательное поле: "Код страны" или "Индекс"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Comment>Вспомогательное поле: "Код города" или "Регион"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Comment>Вспомогательное поле: "Номер телефона" или "Район"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Comment>Вспомогательное поле: "Внутренний (или добавочный)  номер" или "Город"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Comment>Вспомогательное поле: "Населенный пункт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Comment>Вспомогательное поле: "Улица"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Comment>Вспомогательное поле: "Дом"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Comment>Вспомогательное поле: "Корпус"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Comment>Вспомогательное поле: "Квартира"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Comment>Строковое представление контактной информации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Comment>Вспомогательное поле: "Подъезд"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле11</Name>
					<Comment>Вспомогательное поле: "Этаж"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле12</Name>
					<Comment>Вспомогательное поле: "Код двери/домофон"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтанцияМетро</Name>
					<Comment>Станция метро</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтанцииМетро</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГородскойРайон</Name>
					<Comment>Городской район проживания</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Районы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>CRM_ПолеХраненияНомера</Name>
					<Comment>Индексирование тел. номера для поиска</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>31</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>КраткоеПредставление</Name>
					<Comment>Краткое представление</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект-владелец контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияГК</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип контактной информации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Comment>Вид контактной информации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>Типы контактной информации</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>Телефон</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>Адрес</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>E-Mail</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>Веб-страница</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерICQ</Name>
					<Comment>Номер ICQ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>Другая контактная информация (произвольная)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>GoogleАккаунт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/Renault_РаботаСПрофилямиКлиентов/Ext/Module.bsl
Процедура Renault_ОбогащениеПрофилейКлиентов() Экспорт
	
	Прокси = ПолучитьПрокси();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_ПрофилиКлиентов.Ссылка
		|ИЗ
		|	Справочник.Renault_ПрофилиКлиентов КАК Renault_ПрофилиКлиентов
		|ГДЕ
		|	Renault_ПрофилиКлиентов.GoldenId = &GoldenId";
	Запрос.УстановитьПараметр("GoldenId", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.Клиенты.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		Клиент = Выборка.Ссылка.Клиенты[Выборка.Ссылка.Клиенты.Количество()-1].Клиент;
		Ид = Строка(Выборка.Ссылка.Клиенты[Выборка.Ссылка.Клиенты.Количество()-1].Клиент.УникальныйИдентификатор());
		Таблица = СериализаторXDTO.ПрочитатьXDTO(Прокси.GetGoldenId(Ид));
		Если Таблица.Количество() > 0 Тогда
			GoldenId = Новый УникальныйИдентификатор(СтрЗаменить(СтрЗаменить(Таблица[0].golden_ID, "{", ""), "}", ""));
			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.GoldenId = GoldenId;
			Объект.Записать();
			
			Результат = Прокси.GetDataHubInfo(Строка(GoldenId), "dms_get_phones");
			ТаблицаРезультат = СериализаторXDTO.ПрочитатьXDTO(Результат);
			
			 
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	КонтактнаяИнформация.Представление
				|ИЗ
				|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
				|ГДЕ
				|	КонтактнаяИнформация.Объект = &Объект
				|	И КонтактнаяИнформация.Тип = &Тип";
			Запрос.УстановитьПараметр("Объект", Клиент);
			Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
			Таблица = Запрос.Выполнить().Выгрузить();
			
			Для Каждого Строка Из ТаблицаРезультат Цикл
				Найден = Ложь;
				Для Каждого КонтСтрока ИЗ Таблица Цикл
					Если КонтСтрока.Представление = Строка(Строка.CITY_CODE) + Строка(Строка.NUMBER) Тогда
						Найден = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не найден Тогда
					
					ВидКИ = Неопределено;
					
					Для Счетчик = 1 по 10 Цикл
						МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
						МенеджерЗаписи.Объект = Клиент;
						МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
						
						ВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("RenaultТелефон" + Строка(Счетчик));
						Если Не ЗначениеЗаполнено(ВидКИ) Тогда
							Вид = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
							Вид.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
							Вид.Наименование = "RenaultТелефон" + Строка(Счетчик);
							Вид.Записать();
							ВидКИ = Вид.Ссылка;
						КонецЕсли;
						МенеджерЗаписи.Вид = ВидКИ;
						МенеджерЗаписи.Прочитать();
						Если Не МенеджерЗаписи.Выбран() Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Объект = Клиент;
					МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
					МенеджерЗаписи.Вид = ВидКИ;
					МенеджерЗаписи.Представление = Строка(Строка.CITY_CODE) + Строка(Строка.NUMBER);
					МенеджерЗаписи.Записать();
				КонецЕсли;
				
			КонецЦикла;
			
			Результат = Прокси.GetDataHubInfo(Строка(GoldenId), "dms_get_emails");
			ТаблицаРезультат = СериализаторXDTO.ПрочитатьXDTO(Результат);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	КонтактнаяИнформация.Представление
				|ИЗ
				|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
				|ГДЕ
				|	КонтактнаяИнформация.Объект = &Объект
				|	И КонтактнаяИнформация.Тип = &Тип";
			Запрос.УстановитьПараметр("Объект", Клиент);
			Запрос.УстановитьПараметр("Тип", Перечисления.ТипыКонтактнойИнформации.Телефон);
			Таблица = Запрос.Выполнить().Выгрузить();
			
			Для Каждого Строка Из ТаблицаРезультат Цикл
				Найден = Ложь;
				Для Каждого КонтСтрока ИЗ Таблица Цикл
					Если КонтСтрока.Представление = Строка.EMAIL Тогда
						Найден = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Не найден Тогда
					
					ВидКИ = Неопределено;
					
					Для Счетчик = 1 по 10 Цикл
						МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
						МенеджерЗаписи.Объект = Клиент;
						МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
						
						ВидКИ = Справочники.ВидыКонтактнойИнформации.НайтиПоНаименованию("RenaultEmail" + Строка(Счетчик));
						Если Не ЗначениеЗаполнено(ВидКИ) Тогда
							Вид = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
							Вид.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
							Вид.Наименование = "RenaultEmail" + Строка(Счетчик);
							Вид.Записать();
							ВидКИ = Вид.Ссылка;
						КонецЕсли;
						МенеджерЗаписи.Вид = ВидКИ;
						МенеджерЗаписи.Прочитать();
						Если Не МенеджерЗаписи.Выбран() Тогда
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					МенеджерЗаписи = РегистрыСведений.КонтактнаяИнформация.СоздатьМенеджерЗаписи();
					МенеджерЗаписи.Объект = Клиент;
					МенеджерЗаписи.Тип = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
					МенеджерЗаписи.Вид = ВидКИ;
					МенеджерЗаписи.Представление = Строка(Строка.EMAIL);
					МенеджерЗаписи.Записать();
				КонецЕсли;
				
			КонецЦикла;

			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьПрокси()
	
	Настройки = Справочники.Renault_СлужебныеНастройкиБазыДанных[ПараметрыСеанса.DMS_Бренд.Наименование];
	
	// Сериализация полученной таблицы и передача ее в web-сервис
	Адрес = Настройки.АдресWsGate+"ws/ClientsInfo.ws?wsdl";
	ПарольWS = Настройки.ПарольДоступаКВебСервисам;
	ЛогинWS = Настройки.ЛогинДоступаКВебСервисам;
	ОпределениеСервиса = Новый WSОпределения(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		ОпределениеСервиса, 
		"http://renault-nissan.com/schema/ClientsInfo", 
		"Renault_ClientsInfo",
		"Renault_ClientsInfoSoap12",,
		60);
	ВебСервис.Пользователь	 = ЛогинWS;
	ВебСервис.Пароль		 = ПарольWS;
	
	Возврат ВебСервис;
	                         
КонецФункции
